// 27. Создание консольной утилиты, которая печатает список переданных 
// ей аргументов из командной строки. При демонстрации работы программы 
// рассмотреть не менее трех способов передачи аргументов в запускаемый процесс

// В этом файле нет кода, здесь описываются способы запуска
// процесса по пути: решение\x64\Debug\other_process.exe"
// с разным вызовом аргументом командной строки

// 1. исполнить файл в консоли с переданными аргументами
// пример: other_process 2 str 123 'd'

// 2. создать ярлык, в свойствах файла в поле "объект" 
// после пути добавить аргументы

// 3. свойства проекта/отладка/аргументы команды

// дополнительно: через другой процесс, через .bat файл